{
    "projects": [
        {
            "folder": "yesilcam-telefonda",
            "title": {
                "en": "Yeşilçam on the Line",
                "tr": "Yeşilçam Telefonda"
            },
            "description": {
                "tr": "Reo-Tek bünyesinde, İstanbul Sinema Müzesi için geliştirdiğim bu interaktif kurulumda ziyaretçileri nostaljik bir çevirmeli telefon karşılar. Ziyaretçi ahizeyi kaldırdığında, ekranda Yeşilçam'a ait bir konuşma sahnesi oynarken, sahnedeki oyuncunun sesi gerçek zamanlı olarak telefon ahizesinden duyulur. Bu etkileşimli sistem, Türk sinema tarihine bir saygı duruşu niteliğindedir ve ziyaretçilere geçmişle teknolojik bir bağ kurma fırsatı sunar. Yazılım, 20 farklı Yeşilçam filminden seçilmiş telefon sahnelerini içerir; her ahize kaldırıldığında bu sahnelerden biri rastgele olarak oynatılmaktadır. Proje kapsamında retro telefon donanımı, hareket ve ahize sensörleriyle entegre edilerek, yazılım ve donanımın kusursuz bir şekilde bir araya getirildiği etkileyici bir kullanıcı deneyimi tasarlanmıştır.\n\nKullanılan teknolojiler:\n\nMikrodenetleyici: Raspberry Pi\n\nPlatform: Raspbian OS (Linux tabanlı)\n\nYazılım dili: Python\n\nSüreç: Analog telefonların elektronik aksamlarının etkileşimli sisteme uyarlanması, sensör ve kablolamanın montajı, deneyim akışına uygun özel yazılım geliştirme ve sistem entegrasyonu.",
                "en": "Developed under Reo-Tek for the Istanbul Cinema Museum, this interactive installation greets visitors with a nostalgic rotary phone. When the handset is lifted, a dialogue scene from a Yeşilçam film plays on the screen, while the actor's voice is heard in real time through the handset. This interactive system serves as a tribute to the history of Turkish cinema and offers visitors an opportunity to build a technological bridge with the past. The software includes phone scenes selected from 20 different Yeşilçam films; each time the handset is lifted, one of these scenes plays randomly. As part of the project, the retro phone hardware was integrated with motion and receiver sensors, and an impressive user experience was designed through seamless software and hardware integration.\n\nTechnologies used:\n\nMicrocontroller: Raspberry Pi\n\nPlatform: Raspbian OS (Linux-based)\n\nProgramming language: Python\n\nProcess: Adapting the electronics of analog phones to an interactive system, installing sensors and wiring, developing custom software tailored to the experience flow, and full system integration."
            },
            "videoThumbnailTime": 2
        },
        {
            "folder": "kameradan-hikayeye",
            "title": {
                "en": "From Camera to Story",
                "tr": "Kameradan Hikayeye"
            },
            "description": {
                "tr": "İstanbul Sinema Müzesi için Reo-Tek bünyesinde geliştirdiğim bu projede, sinema tarihine yön veren kameraları anlatan dört ayrı etkileşimli ünite yer almaktadır. \"Kameradan Hikayeye\" başlıklı bu uygulamada, Bell & Howell, Pathe, Super 8 ve Arriflex gibi ikonik film kameraları sergilenmektedir. Her bir ünitede bulunan dokunmatik ekranlarda, bu kameraların teknik özellikleri, kamera arkası görüntüler, dönem bilgileri ve bu kameralarla çekilen filmler hakkında zengin görsel ve işitsel içerikler yer alır. Holosonics teknolojisi ile çalışan noktasal hoparlörler sayesinde sesli anlatım yalnızca ünitenin önünde duyulabilir, bu da ziyaretçiye benzersiz ve kişisel bir deneyim sunar.\n\nProjenin hem donanım montajı hem de yazılım geliştirme süreçlerinin tamamı tarafımdan gerçekleştirilmiştir. Etkileşime uygun arayüzler, dokunmatik ekran sistemleri ve özel ses altyapısı bir bütün olarak entegre edilmiştir.\n\nKullanılan teknolojiler:\n- Etkileşime uyarlanmış JavaScript tabanlı frameworkler\n- Dokunmatik ekranlar\n- Noktasal doğrusal ses sistemi (Holosonics Audio Spotlight)\n- Medya içerik yönetimi ve zamanlamaya dayalı görsel/işitsel senkronizasyon yazılımları",
                "en": "In this project I developed under Reo-Tek for the Istanbul Cinema Museum, four separate interactive units explore the cameras that shaped the history of cinema. Titled \"From Camera to Story,\" the installation showcases iconic film cameras such as Bell & Howell, Pathe, Super 8, and Arriflex. Each unit includes a touchscreen display providing rich visual and audio content about the technical specifications, behind-the-scenes footage, historical context, and films shot with these cameras. Using Holosonics directional speakers, audio narration is only audible directly in front of each unit, offering visitors a unique and personalized experience.\n\nI was solely responsible for both the hardware setup and the software development phases of the project. The interfaces, touchscreen integration, and specialized audio infrastructure were all custom-developed and fully integrated.\n\nTechnologies used:\n- JavaScript-based frameworks adapted for interactive use\n- Touchscreen systems\n- Directional audio system (Holosonics Audio Spotlight)\n- Media content management and synchronized audio/visual playback software"
            },
            "videoThumbnailTime": 8
        },
        {
            "folder": "karanligi-aydinlat",
            "title": {
                "en": "Light the Dark",
                "tr": "Karanlığı Aydınlat"
            },
            "description": {
                "tr": "İstanbul Sinema Müzesi için Reo-Tek bünyesinde geliştirdiğim bu projede, sinema tarihine yön veren kameraları anlatan dört ayrı etkileşimli ünite yer almaktadır. \"Kameradan Hikayeye\" başlıklı bu uygulamada, Bell & Howell, Pathe, Super 8 ve Arriflex gibi ikonik film kameraları sergilenmektedir. Her bir ünitede bulunan dokunmatik ekranlarda, bu kameraların teknik özellikleri, kamera arkası görüntüler, dönem bilgileri ve bu kameralarla çekilen filmler hakkında zengin görsel ve işitsel içerikler yer alır. Holosonics teknolojisi ile çalışan noktasal hoparlörler sayesinde sesli anlatım yalnızca ünitenin önünde duyulabilir, bu da ziyaretçiye benzersiz ve kişisel bir deneyim sunar.\n\nProjenin hem donanım montajı hem de yazılım geliştirme süreçlerinin tamamı tarafımdan gerçekleştirilmiştir. Etkileşime uygun arayüzler, dokunmatik ekran sistemleri ve özel ses altyapısı bir bütün olarak entegre edilmiştir.\n\nKullanılan teknolojiler:\n- Etkileşime uyarlanmış JavaScript tabanlı frameworkler\n- Dokunmatik ekranlar\n- Noktasal doğrusal ses sistemi (Holosonics Audio Spotlight)\n- Medya içerik yönetimi ve zamanlamaya dayalı görsel/işitsel senkronizasyon yazılımları",
                "en": "In this project I developed under Reo-Tek for the Istanbul Cinema Museum, four separate interactive units explore the cameras that shaped the history of cinema. Titled \"From Camera to Story,\" the installation showcases iconic film cameras such as Bell & Howell, Pathe, Super 8, and Arriflex. Each unit includes a touchscreen display providing rich visual and audio content about the technical specifications, behind-the-scenes footage, historical context, and films shot with these cameras. Using Holosonics directional speakers, audio narration is only audible directly in front of each unit, offering visitors a unique and personalized experience.\n\nI was solely responsible for both the hardware setup and the software development phases of the project. The interfaces, touchscreen integration, and specialized audio infrastructure were all custom-developed and fully integrated.\n\nTechnologies used:\n- JavaScript-based frameworks adapted for interactive use\n- Touchscreen systems\n- Directional audio system (Holosonics Audio Spotlight)\n- Media content management and synchronized audio/visual playback software"
            },
            "videoThumbnailTime": 2
        }
    ]
}
