{
    "projects": [
        {
            "folder": "gobeklitepe-gathering",
            "title": {
                "en": "Gobeklitepe - The Gathering",
                "tr": "Göbeklitepe - Toplanış"
            },
            "subtitle": {
                "en": "Cer Modern",
                "tr": "Cer Modern"
            },
            "description": {
                "tr": "Bu interaktif kurulum, Göbeklitepe'nin dairesel alanlarındaki 12 taştan esinlenerek tasarlanmış platformları içeriyor. Her platformda, ziyaretçilerin ellerini yerleştirebileceği özel oyuklar bulunuyor. Ziyaretçiler ellerini bu oyuklara yerleştirdiğinde, sensörler aracılığıyla algılanan hareketler, mikrodenetleyici üzerinden sisteme aktarılarak 360 derece projeksiyon alanında görsel bir deneyime dönüşüyor. Bu sistem, günümüz insanı ile Göbeklitepe insanları arasında interaktif bir köprü kuruyor.\n\nTeknolojiler:\n• Arduino ve LDR sensör ağı\n• Serial port üzerinden gerçek zamanlı veri iletişimi",
                "en": "This interactive installation features platforms inspired by the 12 stones in Göbeklitepe's circular areas. Each platform contains specially designed cavities for visitors to place their hands. When visitors place their hands in these cavities, movements detected through sensors are transmitted via microcontroller to create a visual experience in the 360-degree projection area. This system builds an interactive bridge between modern humans and the people of Göbeklitepe.\n\nTechnologies:\n• Arduino and LDR sensor network\n• Real-time data communication via serial port"
            },
            "videoThumbnailTime": 7,
            "media": ["1.gif", "2.webp", "3.mp4"]
        },
        {
            "folder": "yesilcam-telefonda",
            "title": {
                "en": "Yeşilçam on the Line",
                "tr": "Yeşilçam Telefonda"
            },
            "subtitle": {
                "en": "Istanbul Cinema Museum",
                "tr": "İstanbul Sinema Müzesi"
            },
            "description": {
                "tr": "İstanbul Sinema Müzesi için tasarlanan bu etkileşimli deneyim, klasik Türk sinemasının telefon sahnelerini canlandırıyor. Ziyaretçiler, retro telefon ahizesini kaldırdıklarında, ekranda oynayan sahnedeki oyuncunun sesi gerçek zamanlı olarak ahizeden duyuluyor. 20 farklı filmden seçilen sahneler, her etkileşimde rastgele olarak oynatılıyor.\n\nTeknolojiler:\n• Raspberry Pi ve Raspbian OS\n• Python ile gömülü sistem yazılımı\n• Sensör entegrasyonu ve donanım kontrolü",
                "en": "This interactive experience for the Istanbul Cinema Museum brings to life phone scenes from classic Turkish cinema. When visitors lift the retro phone handset, the actor's voice from the scene playing on screen is heard in real-time through the handset. Scenes from 20 different films play randomly with each interaction.\n\nTechnologies:\n• Raspberry Pi and Raspbian OS\n• Embedded system software with Python\n• Sensor integration and hardware control"
            },
            "videoThumbnailTime": 2,
            "media": ["1.gif", "2.webp", "3.mp4"]
        },
        {
            "folder": "kameradan-hikayeye",
            "title": {
                "en": "From Camera to Story",
                "tr": "Kameradan Hikayeye"
            },
            "subtitle": {
                "en": "Istanbul Cinema Museum",
                "tr": "İstanbul Sinema Müzesi"
            },
            "description": {
                "tr": "İstanbul Sinema Müzesi'nde sergilenen bu interaktif kurulum, sinema tarihine yön veren dört ikonik kamerayı keşfediyor. Bell & Howell, Pathe, Super 8 ve Arriflex kameralarının teknik özellikleri, kamera arkası görüntüler ve dönem bilgileri, dokunmatik ekranlarda sunuluyor. Holosonics teknolojisi ile çalışan noktasal hoparlörler, sesli anlatımı sadece ünitenin önünde duyulabilir kılıyor.\n\nTeknolojiler:\n• JavaScript tabanlı interaktif frameworkler\n• Dokunmatik ekran sistemleri\n• Holosonics Audio Spotlight\n• Medya senkronizasyon yazılımları",
                "en": "This interactive installation at the Istanbul Cinema Museum explores four iconic cameras that shaped cinema history. Technical specifications, behind-the-scenes footage, and historical context of Bell & Howell, Pathe, Super 8, and Arriflex cameras are presented on touchscreens. Using Holosonics directional speakers, audio narration is only audible directly in front of each unit.\n\nTechnologies:\n• JavaScript-based interactive frameworks\n• Touchscreen systems\n• Holosonics Audio Spotlight\n• Media synchronization software"
            },
            "videoThumbnailTime": 11,
            "media": ["1.gif", "2.webp", "3.mp4"]
        },
        {
            "folder": "karanligi-aydinlat",
            "title": {
                "en": "Light the Dark",
                "tr": "Karanlığı Aydınlat"
            },
            "subtitle": {
                "en": "UN Women",
                "tr": "UN Women"
            },
            "description": {
                "tr": "Bu yerleştirme, toplumsal şiddet olaylarını ve etkilerini ele alan interaktif bir deneyim sunuyor. Ziyaretçiler, masumiyeti temsil eden ışık halkalarının altından geçerken, şiddet mağdurlarının anılarına tanıklık ediyor. Arkadan gelen ziyaretçilerin gölgeleri, masumiyet kavramını sorgulatan bir boyut katıyor.\n\nTeknolojiler:\n• Mikrodenetleyici ve C++ yazılımı\n• PCB üzerinde güç yönetimi\n• Sensör ve LED kontrol sistemleri",
                "en": "This installation offers an interactive experience addressing social violence and its effects. As visitors walk beneath rings of light symbolizing innocence, they witness the memories of violence victims. The shadows of approaching visitors add a dimension that questions the concept of innocence.\n\nTechnologies:\n• Microcontroller and C++ software\n• Power management on PCB\n• Sensor and LED control systems"
            },
            "videoThumbnailTime": 2,
            "media": ["1.gif", "2.webp", "3.mp4"]
        }
    ]
}
